x=["μ", "σ", "+", "-"]

@test RFlavor.rep(x, collect(1:4)) == String["μ","σ","σ","+","+","+","-","-","-","-"]
RFlavor.rep(x, collect(1:4), 2) == String["μ","σ","σ","+","+","+","-","-","-","-","μ","σ","σ","+","+","+","-","-","-","-"]
RFlavor.rep(x, 1:4) == String["μ","σ","σ","+","+","+","-","-","-","-"]
RFlavor.rep(x, 1:4, 2) == String["μ","σ","σ","+","+","+","-","-","-","-","μ","σ","σ","+","+","+","-","-","-","-"]
RFlavor.rep(x, each=1:4) == String["μ","σ","σ","+","+","+","-","-","-","-"]
RFlavor.rep(x, each=1:4, times=2) == String["μ","σ","σ","+","+","+","-","-","-","-","μ","σ","σ","+","+","+","-","-","-","-"]
RFlavor.rep(x, times=2) == String["μ","σ","+","-","μ","σ","+","-"]
#The following does not work
#rep(x, each=2, times=2)
