x=["μ", "σ", "+", "-"]

@test RFlavor.rep(x, collect(1:4)) == String["μ","σ","σ","+","+","+","-","-","-","-"]
@test RFlavor.rep(x, collect(1:4), 2) == String["μ","σ","σ","+","+","+","-","-","-","-","μ","σ","σ","+","+","+","-","-","-","-"]
@test RFlavor.rep(x, 1:4) == String["μ","σ","σ","+","+","+","-","-","-","-"]
@test RFlavor.rep(x, 1:4, 2) == String["μ","σ","σ","+","+","+","-","-","-","-","μ","σ","σ","+","+","+","-","-","-","-"]
@test RFlavor.rep(x, 2) == String["μ","σ","+","-","μ","σ","+","-"]
@test RFlavor.rep(x, lengths=1:4) == String["μ","σ","σ","+","+","+","-","-","-","-"]
@test RFlavor.rep(x, lengths=1:4, times=2) == String["μ","σ","σ","+","+","+","-","-","-","-","μ","σ","σ","+","+","+","-","-","-","-"]
@test RFlavor.rep(x, times=2) == String["μ","σ","+","-","μ","σ","+","-"]

@test RFlavor.rep(x, each=2, times=2) == String["μ","μ","σ","σ","+","+","-","-","μ","μ","σ","σ","+","+","-","-"]

@test RFlavor.rep(x, 2, 2) == String["μ","μ","σ","σ","+","+","-","-","μ","μ","σ","σ","+","+","-","-"]

@test RFlavor.rep_len(x, 13) == String["μ","σ","+","-","μ","σ","+","-","μ","σ","+","-","μ"]
